#include "lq_all_demo.hpp"

/********************************************************************************
 * @file    lq_module_load_demo.cpp
 * @brief   模块加载测试.
 * @author  龙邱科技-012
 * @date    2026-03-18
 * @version V2.1.0
 * @note    适用与龙芯 2K0300/0301 平台.
 *          本 demo 实现 模块加载 功能，用于测试 模块加载 控制器的基本功能.
 ********************************************************************************/

/********************************************************************************
 *  @brief   模块加载测试程序.
 *  @param   none.
 *  @return  none.
 *! @note    可以将需要加载的模块名称存放到容器中，再批量加载模块
 *! @note    也可以通过string类型的参数直接加载单个模块
 *! @note    模块可以存放在 /home/ 目录下的任何地方，程序内部会自动检测存放位置.
 ********************************************************************************/
void lq_module_load_demo(void)
{
    // 设置需要加载的模块名称
    std::vector<std::string> mod = {
        "IPS_ST7789_dev.ko",
        "IPS_ST7789_dri.ko",
    };
    // 加载模块
    lq_module_load load(mod);

    sleep(10);  // 等待10s

    // 卸载全部加载的模块
    load.set_unload_all_module();
}